In [37]:
import pandas as pd

In [38]:
df = pd.read_csv("salaries.csv")
df.head()

  company                  job     degree  salary_more_then_100k
0  google      sales executive  bachelors                      0
1  google      sales executive    masters                      0
2  google     business manager  bachelors                      1
3  google     business manager    masters                      1
4  google  computer programmer  bachelors                      0

In [39]:
input = df.drop("salary_more_then_100k", axis = "columns")
input

       company                  job     degree
0       google      sales executive  bachelors
1       google      sales executive    masters
2       google     business manager  bachelors
3       google     business manager    masters
4       google  computer programmer  bachelors
5       google  computer programmer    masters
6   abc pharma      sales executive    masters
7   abc pharma  computer programmer  bachelors
8   abc pharma     business manager  bachelors
9   abc pharma     business manager    masters
10    facebook      sales executive  bachelors
11    facebook      sales executive    masters
12    facebook     business manager  bachelors
13    facebook     business manager    masters
14    facebook  computer programmer  bachelors
15    facebook  computer programmer    masters

In [40]:
target = df.salary_more_then_100k
target

0     0
1     0
2     1
3     1
4     0
5     1
6     0
7     0
8     0
9     1
10    1
11    1
12    1
13    1
14    1
15    1
Name: salary_more_then_100k, dtype: int64

In [41]:
from sklearn.preprocessing import LabelEncoder

In [42]:
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

In [43]:
input['company_n'] = le_company.fit_transform(input['company'])
input['job_n'] = le_job.fit_transform(input['job'])
input['degree_n'] = le_degree.fit_transform(input['degree'])
input

       company                  job     degree  company_n  job_n  degree_n
0       google      sales executive  bachelors          2      2         0
1       google      sales executive    masters          2      2         1
2       google     business manager  bachelors          2      0         0
3       google     business manager    masters          2      0         1
4       google  computer programmer  bachelors          2      1         0
5       google  computer programmer    masters          2      1         1
6   abc pharma      sales executive    masters          0      2         1
7   abc pharma  computer programmer  bachelors          0      1         0
8   abc pharma     business manager  bachelors          0      0         0
9   abc pharma     business manager    masters          0      0         1
10    facebook      sales executive  bachelors          1      2         0
11    facebook      sales executive    masters          1      2         1
12    facebook     business manager  bachelors          1      0         0
13    facebook     business manager    masters          1      0         1
14    facebook  computer programmer  bachelors          1      1         0
15    facebook  computer programmer    masters          1      1         1

In [44]:
input = input.drop(['company','job','degree'], axis = "columns")
print(input)

    company_n  job_n  degree_n
0           2      2         0
1           2      2         1
2           2      0         0
3           2      0         1
4           2      1         0
5           2      1         1
6           0      2         1
7           0      1         0
8           0      0         0
9           0      0         1
10          1      2         0
11          1      2         1
12          1      0         0
13          1      0         1
14          1      1         0
15          1      1         1

In [48]:
from sklearn import tree
from sklearn.model_selection import train_test_split

In [49]:
model = tree.DecisionTreeClassifier()

In [64]:
X_train, X_test, y_train, y_test = train_test_split(input, target, test_size=0.3)

In [65]:
X_test

    company_n  job_n  degree_n
3           2      0         1
12          1      0         0
7           0      1         0
10          1      2         0
13          1      0         1

In [66]:
y_test

3     1
12    1
7     0
10    1
13    1
Name: salary_more_then_100k, dtype: int64

In [67]:
model.fit(X_train,y_train)

DecisionTreeClassifier()

In [68]:
model.score(X_test, y_test)

1.0

In [69]:
model.predict([[1,0,1]])

C:\Users\ASUS\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)

In [70]:
model.fit(input, target)

DecisionTreeClassifier()

In [71]:
model.score(X_test,y_test)

1.0

In [73]:
model.predict([[2,1,0]])

C:\Users\ASUS\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

## Excercise

In [74]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [82]:
X = df.drop(['PassengerId','Survived','Name','SibSp','Parch','Ticket','Fare','Cabin','Embarked'], axis = 'columns')
X.head()

   Pclass     Sex   Age
0       3    male  22.0
1       1  female  38.0
2       3  female  26.0
3       1  female  35.0
4       3    male  35.0

In [83]:
Y = df.Survived
Y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [84]:
le_sex = LabelEncoder()

In [85]:
X['Sex_n'] = le_sex.fit_transform(X['Sex'])
X

     Pclass     Sex   Age  Sex_n
0         3    male  22.0      1
1         1  female  38.0      0
2         3  female  26.0      0
3         1  female  35.0      0
4         3    male  35.0      1
..      ...     ...   ...    ...
886       2    male  27.0      1
887       1  female  19.0      0
888       3  female   NaN      0
889       1    male  26.0      1
890       3    male  32.0      1

[891 rows x 4 columns]

In [87]:
X = X.drop('Sex', axis = 'columns')
X

     Pclass   Age  Sex_n
0         3  22.0      1
1         1  38.0      0
2         3  26.0      0
3         1  35.0      0
4         3  35.0      1
..      ...   ...    ...
886       2  27.0      1
887       1  19.0      0
888       3   NaN      0
889       1  26.0      1
890       3  32.0      1

[891 rows x 3 columns]

In [93]:
X = X.fillna(method = 'ffill')
X

     Pclass   Age  Sex_n
0         3  22.0      1
1         1  38.0      0
2         3  26.0      0
3         1  35.0      0
4         3  35.0      1
..      ...   ...    ...
886       2  27.0      1
887       1  19.0      0
888       3  26.0      0
889       1  26.0      1
890       3  32.0      1

[891 rows x 3 columns]

In [94]:
model.fit(X,Y)

DecisionTreeClassifier()

In [95]:
model.score(X,Y)

0.8720538720538721

In [96]:
model.predict([[3,30,1]])

C:\Users\ASUS\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([0], dtype=int64)

In [98]:
model.predict([[1,10,0]])

C:\Users\ASUS\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but DecisionTreeClassifier was fitted with feature names
  warnings.warn(

array([1], dtype=int64)